Masmiseim36/nxpSDK/devices/MIMXRT685S/MIMXRT685S_cm33.xml
<?xml version="1.0" encoding="UTF-8"?>
<device schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD.xsd">
  <vendor>nxp.com</vendor>
  <name>MIMXRT685S_cm33</name>
  <version>1.0</version>
  <description>MIMXRT685SFAWBR,MIMXRT685SFFOB,MIMXRT685SFVKB,MIMXRT685SVFVKB</description>
  <licenseText>
Copyright 2016-2025 NXP
SPDX-License-Identifier: BSD-3-Clause
  </licenseText>
  <cpu>
    <name>CM33</name>
    <revision>r2p0</revision>
    <endian>little</endian>
    <mpuPresent>true</mpuPresent>
    <fpuPresent>true</fpuPresent>
    <vtorPresent>true</vtorPresent>
    <nvicPrioBits>3</nvicPrioBits>
    <vendorSystickConfig>false</vendorSystickConfig>
  </cpu>
  <addressUnitBits>8</addressUnitBits>
  <width>32</width>
  <peripherals>
    <peripheral>
      <name>RSTCTL0</name>
      <description>reset ccontroller 0</description>
      <groupName>RSTCTL0</groupName>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x7C</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>SYSRSTSTAT</name>
          <description>system reset status register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xF1</resetMask>
          <fields>
            <field>
              <name>VDD_POR</name>
              <description>VDD POR Event Detected:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EVENT_DETECTED</name>
                  <description>No event detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>POR_EVENT_DETECTED</name>
                  <description>VDD POR event detected. (Writing a '1' to this bit clears this status).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PAD_RESET</name>
              <description>PAD RESET Event Detected:</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EVENT_DETECTED</name>
                  <description>No EVENT Detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_DETECTED</name>
                  <description>RESET Detected. (Write 1 to CLR),</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ARM_APD_RESET</name>
              <description>ARM RESET Event Detected:</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EVENT_DETECTED</name>
                  <description>No event detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET_DETECTED</name>
                  <description>ARM reset event detected. (Writing a '1' to this bit clears this status).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT0_RESET</name>
              <description>WDT0 RESET Event Detected:</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EVENT_DETECTED</name>
                  <description>No EVENT Detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT0_RESET_DETECTED</name>
                  <description>WDT0 reset event detected. (Writing a '1' to this bit clears this status).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDT1_RESET</name>
              <description>WDT1 RESET Event Detected:</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EVENT_DETECTED</name>
                  <description>No EVENT Detected.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDT1_RESET_DETECTED</name>
                  <description>WDT1 reset event detected. (Writing a 1 to this bit clears this status).</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTCTL0</name>
          <description>peripheral reset control register 0</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F11F02</resetValue>
          <resetMask>0x1F11F02</resetMask>
          <fields>
            <field>
              <name>HIFI_DSP</name>
              <description>HIFI DSP reset control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>POWERQUAD</name>
              <description>powerquad reset control</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CASPER</name>
              <description>CAPSER reset control</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HASHCRYPT</name>
              <description>HASHCRYPT reset control</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUF</name>
              <description>PUF reset control</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RNG</name>
              <description>RNG reset control</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLEXSPI_OTFAD</name>
              <description>FLEXSPI reset control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBHS_PHY</name>
              <description>USB PHY reset control</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBHS_DEVICE</name>
              <description>USB DEVICE reset control</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBHS_HOST</name>
              <description>USB HOST reset control</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBHS_SRAM</name>
              <description>USBHS RAM reset control</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCT</name>
              <description>SCT reset control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTCTL1</name>
          <description>peripheral reset control register 1</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x101810C</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SDIO0</name>
              <description>SDIO0 reset control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDIO1</name>
              <description>SDIO1 reset control</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMP0</name>
              <description>Analog comparator reset control</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC0</name>
              <description>ADC reset control</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHSGPIO0</name>
              <description>SHSGPIO0 reset control</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSTCTL2</name>
          <description>peripheral reset control register 2</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1C000001</resetValue>
          <resetMask>0x1C000003</resetMask>
          <fields>
            <field>
              <name>UTICK0</name>
              <description>utick reset control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WWDT0</name>
              <description>wdt reset control</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLEAR_RESET</name>
                  <description>clear reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET_RESET</name>
                  <description>set reset</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
