Masmiseim36/nxpSDK/devices/MIMXRT685S/MIMXRT685S_cm33.xml
        <register>
          <name>AUDIOPLLCLKDIV</name>
          <description>audio pll0 clock divider</description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xE00000FF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock Divider Value Selection. . . 0: Divide by 1. ... 255: Divide by 256.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Resets the divider counter. Can be used to make sure a new divider value is used right away rather than completing the previous count.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALT</name>
              <description>Halts the divider counter. The intent is to allow the divider's clock source to be changed without the risk of a glitch at the output.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQFLAG</name>
              <description>Divider status flag. Set when a change is made to the divider value, cleared when the change is complete.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSPCPUCLKDIV</name>
          <description>DSP cpu clock divider</description>
          <addressOffset>0x400</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x40000000</resetValue>
          <resetMask>0xE00000FF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Clock Divider Value Selection. . . 0: Divide by 1. ... 255: Divide by 256.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET</name>
              <description>Resets the divider counter. Can be used to make sure a new divider value is used right away rather than completing the previous count.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HALT</name>
              <description>Halts the divider counter. The intent is to allow the divider's clock source to be changed without the risk of a glitch at the output.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQFLAG</name>
              <description>Divider status flag. Set when a change is made to the divider value, cleared when the change is complete.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DSPMAINRAMCLKDIV</name>
          <description>DSP main ram clock divider</description>
          <addressOffset>0x404</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>DSPMRAMCLKDIV</name>
              <description>DSP MAINRAM Clock Ratio Control:</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DSP_CLK_DIV_BY_1</name>
                  <description>DSP MAINRAM Clk = DSP Core CLK / 1.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_CLK_DIV_BY_2</name>
                  <description>DSP MAINRAM Clk = DSP Core CLK / 2.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_CLK_DIV_BY_3</name>
                  <description>DSP MAINRAM Clk = DSP Core CLK / 3.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_CLK_DIV_BY_4</name>
                  <description>DSP MAINRAM Clk = DSP Core CLK / 4.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSPCPUCLKSELA</name>
          <description>DSP clock selection A</description>
          <addressOffset>0x430</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Control Main 1st Stage Control Clock Source. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FFRO_CLK</name>
                  <description>FFRO Clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTAL_CLK</name>
                  <description>XTALIN Clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOSC</name>
                  <description>Low Power Oscillator Clock (LPOSC).</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFRO_CLK</name>
                  <description>SFRO Clock.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSPCPUCLKSELB</name>
          <description>DSP clock selection B</description>
          <addressOffset>0x434</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Main Clock Source Selection. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAIN_1ST_CLK</name>
                  <description>MAINCLKSELA 1st Stage Clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN_PLL_CLK</name>
                  <description>Main System PLL Clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSP_PLL_CLK</name>
                  <description>DSP System PLL Clock.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_32K_CLK</name>
                  <description>RTC 32KHz Clock.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>OSEVENTFCLKSEL</name>
          <description>OS EVENT clock selection</description>
          <addressOffset>0x480</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>OS Event Timer Functional Clock Source Selection. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LPOSC</name>
                  <description>Low Power Oscillator Clock (LPOSC).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_32KHZ_CLK</name>
                  <description>RTC 32KHz Clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TEAL_FREE_RUNNING_CLK</name>
                  <description>Teal Free Running Clock (Global Time Stamping)</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, this may be selected in order to reduce power when no output is needed.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>8</dim>
          <dimIncrement>0x20</dimIncrement>
          <name>FLEXCOMM[%s]</name>
          <description>flexcomm clock controller</description>
          <addressOffset>0x500</addressOffset>
          <register>
            <name>FRGCLKSEL</name>
            <description>FRG clock selection register N</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x7</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>SEL</name>
                <description>Fractional Gen. Clock Source Selection. . .</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>MAIN_CLK</name>
                    <description>Main Clock.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FRG_PLL_CLK</name>
                    <description>FRG PLL Clock.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SFRO_CLK</name>
                    <description>SFRO Clock.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FFRO_CLK</name>
                    <description>FFRO Clock.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NONE</name>
                    <description>None, this may be selected in order to reduce power when no output is needed.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
          <register>
            <name>FRGCTL</name>
            <description>FRG clock controller</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xFF</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>DIV</name>
                <description>Denominator of the fractional divider. DIV is equal to the programmed value +1. Always set to 0xFF to use with the fractional baud rate generator.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
              <field>
                <name>MULT</name>
                <description>Numerator of the fractional divider. MULT is equal to the programmed value.</description>
                <bitOffset>8</bitOffset>
                <bitWidth>8</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>FCFCLKSEL</name>
            <description>flexcomm clock selection</description>
            <addressOffset>0x8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x7</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>SEL</name>
                <description>Flexxcomm Functional Clock Source Selection. . .</description>
                <bitOffset>0</bitOffset>
                <bitWidth>3</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>SFRO_CLK</name>
                    <description>SFRO Clock.</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FFRO_CLK</name>
                    <description>FFRO Clock.</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>AUDIO_PLL_CLK</name>
                    <description>Audio PLL Clock.</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>MASTER_CLK</name>
                    <description>Master Clock In.</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>FCN_FRG_CLK</name>
                    <description>FCn FRG Clock.</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>NONE</name>
                    <description>None, this may be selected in order to reduce power when no output is needed.</description>
                    <value>0x7</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <name>FRG14CLKSEL</name>
          <description>FRG clock selection register 14</description>
          <addressOffset>0x6C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Fractional Gen. Clock Source Selection. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAIN_CLK</name>
                  <description>Main Clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRG_PLL_CLK</name>
                  <description>Main System PLL Clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFRO_CLK</name>
                  <description>SFRO Clock.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFRO_CLK</name>
                  <description>FFRO Clock.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, this may be selected in order to reduce power when no output is needed.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRG14CTL</name>
          <description>FRG clock controller 14</description>
          <addressOffset>0x6C4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Denominator of the fractional divider. DIV is equal to the programmed value +1. Always set to 0xFF to use with the fractional baud rate generator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULT</name>
              <description>Numerator of the fractional divider. MULT is equal to the programmed value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FC14FCLKSEL</name>
          <description>flexcomm14 clock selection</description>
          <addressOffset>0x6C8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Flexxcomm Functional Clock Source Selection. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SFRO_CLK</name>
                  <description>SFRO Clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFRO_CLK</name>
                  <description>FFRO Clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUDIO_PLL_CLK</name>
                  <description>Audio PLL Clock.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER_CLK</name>
                  <description>Master Clock In.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FCN_FRG_CLK</name>
                  <description>FCn FRG Clock.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, this may be selected in order to reduce power when no output is needed.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRG15CLKSEL</name>
          <description>FRG clock selection register 15</description>
          <addressOffset>0x6E0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7</resetValue>
          <resetMask>0x7</resetMask>
          <fields>
            <field>
              <name>SEL</name>
              <description>Fractional Gen. Clock Source Selection. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MAIN_CLK</name>
                  <description>Main Clock.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRG_PLL_CLK</name>
                  <description>Main System PLL Clock.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFRO_CLK</name>
                  <description>SFRO Clock.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFRO_CLK</name>
                  <description>FFRO Clock.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>None, this may be selected in order to reduce power when no output is needed.</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FRG15CTL</name>
          <description>FRG clock controller 15</description>
          <addressOffset>0x6E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>DIV</name>
              <description>Denominator of the fractional divider. DIV is equal to the programmed value +1. Always set to 0xFF to use with the fractional baud rate generator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MULT</name>
              <description>Numerator of the fractional divider. MULT is equal to the programmed value.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
