Masmiseim36/nxpSDK/devices/MIMXRT685S/MIMXRT685S_cm33.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>SYSCTL1</name>
      <description>system ccontroller 1</description>
      <groupName>SYSCTL1</groupName>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x204</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>MCLKPINDIR</name>
          <description>mclk direction control</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x1</resetMask>
          <fields>
            <field>
              <name>MCLKPINDIR</name>
              <description>Selects one of the M33 interrupt sources</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT_DIRECTION</name>
                  <description>MCLK is in input direction.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT_DIRECTION</name>
                  <description>MCLK is in the output direction.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DSPNMISRCSEL</name>
          <description>DSP NMI source selection</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x5</resetValue>
          <resetMask>0x8000001F</resetMask>
          <fields>
            <field>
              <name>NMISRCSEL</name>
              <description>Selects one of the DSP interrupt sources as the NMI source. See DSP Interrupt Slot Table for Interrupt Slot Numers.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NMIEN</name>
              <description>NMI interrupt enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Disable NMI Interrupt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Enable NMI Interrupt.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>FCCTRLSEL%s</name>
          <description>flexcomm control selection N</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3030303</resetMask>
          <fields>
            <field>
              <name>SCKINSEL</name>
              <description>SCK IN Select. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ORIG_FLEX_I2S_SIGNALS</name>
                  <description>Original FLEXCOMM I2S signals</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET0_I2S_SIGNALS</name>
                  <description>Shared Set0 I2S signals.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET1_I2S_SIGNALS</name>
                  <description>Shared Set1 I2S signals.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WSINSEL</name>
              <description>WS IN Select. . .</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ORIG_FLEX_I2S_SIGNALS</name>
                  <description>Original FLEXCOMM I2S signals</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET0_I2S_SIGNALS</name>
                  <description>Shared Set0 I2S signals.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET1_I2S_SIGNALS</name>
                  <description>Shared Set1 I2S signals.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAINSEL</name>
              <description>DATA IN Select. . .</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ORIG_FLEX_I2S_SIGNALS</name>
                  <description>Original FLEXCOMM I2S signals</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET0_I2S_SIGNALS</name>
                  <description>Shared Set0 I2S signals.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET1_I2S_SIGNALS</name>
                  <description>Shared Set1 I2S signals.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAOUTSEL</name>
              <description>DATA OUT Select. . .</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ORIG_FLEX_I2S_SIGNALS</name>
                  <description>Original FLEXCOMM I2S signals</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET0_I2S_SIGNALS</name>
                  <description>Shared Set0 I2S signals.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHARED_SET1_I2S_SIGNALS</name>
                  <description>Shared Set1 I2S signals.</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1</dimIndex>
          <name>SHAREDCTRLSET%s</name>
          <description>shared control set N</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF0777</resetMask>
          <fields>
            <field>
              <name>SHAREDSCKSEL</name>
              <description>Shared SCK Select. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCOMM0</name>
                  <description>FLEXCOMM0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM1</name>
                  <description>FLEXCOMM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM2</name>
                  <description>FLEXCOMM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM3</name>
                  <description>FLEXCOMM3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM4</name>
                  <description>FLEXCOMM4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM5</name>
                  <description>FLEXCOMM5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM6</name>
                  <description>FLEXCOMM6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM7</name>
                  <description>FLEXCOMM7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHAREDWSSEL</name>
              <description>Shared WS Select. . .</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCOMM0</name>
                  <description>FLEXCOMM0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM1</name>
                  <description>FLEXCOMM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM2</name>
                  <description>FLEXCOMM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM3</name>
                  <description>FLEXCOMM3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM4</name>
                  <description>FLEXCOMM4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM5</name>
                  <description>FLEXCOMM5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM6</name>
                  <description>FLEXCOMM6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM7</name>
                  <description>FLEXCOMM7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SHAREDDATASEL</name>
              <description>Shared DATA Select. . .</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLEXCOMM0</name>
                  <description>FLEXCOMM0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM1</name>
                  <description>FLEXCOMM1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM2</name>
                  <description>FLEXCOMM2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM3</name>
                  <description>FLEXCOMM3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM4</name>
                  <description>FLEXCOMM4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM5</name>
                  <description>FLEXCOMM5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM6</name>
                  <description>FLEXCOMM6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLEXCOMM7</name>
                  <description>FLEXCOMM7</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC0DATAOUTEN</name>
              <description>FLEXCOMM0 DATAOUT OUTPUT ENABLE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC1DATAOUTEN</name>
              <description>FLEXCOMM1 DATAOUT OUTPUT ENABLE</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>F20DATAOUTEN</name>
              <description>FLEXCOMM2 DATAOUT OUTPUT ENABLE</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC3DATAOUTEN</name>
              <description>FLEXCOMM3 DATAOUT OUTPUT ENABLE</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC4DATAOUTEN</name>
              <description>FLEXCOMM4 DATAOUT OUTPUT ENABLE</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC5DATAOUTEN</name>
              <description>FLEXCOMM5 DATAOUT OUTPUT ENABLE</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC6DATAOUTEN</name>
              <description>FLEXCOMM6 DATAOUT OUTPUT ENABLE</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FC7DATAOUTEN</name>
              <description>FLEXCOMM7 DATAOUT OUTPUT ENABLE</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INPUT</name>
                  <description>Input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTPUT</name>
                  <description>Output</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RXEVPULSEGEN</name>
          <description>RX Event Pulse Generator</description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RXEVPULSEGEN</name>
              <description>RX Event Pulse Generator. Writing a '1' to this register will create a one PSCLK pulse width of logic '1'. It is automatically cleared.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_EFFECT</name>
                  <description>No effect.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE_RXEV_HIGH</name>
                  <description>Pulse RXEV High for one PSCLK cycle.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
