Masmiseim36/nxpSDK/devices/MIMXRT685S/MIMXRT685S_cm33.xml
        <cluster>
          <dim>5</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CT32BIT_CAP_SEL[%s]</name>
          <description>CT32BITn Counter Timer Capture Trigger Multiplexers</description>
          <addressOffset>0x600</addressOffset>
          <register>
            <dim>4</dim>
            <dimIncrement>0x4</dimIncrement>
            <dimIndex>0,1,2,3</dimIndex>
            <name>CT32BIT_CAP_SEL%s</name>
            <description>CT32BIT N Counter Timer Capture Trigger Multiplexers M</description>
            <addressOffset>0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x1F</resetValue>
            <resetMask>0x1F</resetMask>
            <fields>
              <field>
                <name>CAPn_SEL</name>
                <description>Counter Timer m, Capture Port Input n 19:1 Mux Select. . .</description>
                <bitOffset>0</bitOffset>
                <bitWidth>5</bitWidth>
                <access>read-write</access>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>CT_INP0</name>
                    <description>CT_INP0</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP1</name>
                    <description>CT_INP1</description>
                    <value>0x1</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP2</name>
                    <description>CT_INP2</description>
                    <value>0x2</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP3</name>
                    <description>CT_INP3</description>
                    <value>0x3</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP4</name>
                    <description>CT_INP4</description>
                    <value>0x4</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP5</name>
                    <description>CT_INP5</description>
                    <value>0x5</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP6</name>
                    <description>CT_INP6</description>
                    <value>0x6</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP7</name>
                    <description>CT_INP7</description>
                    <value>0x7</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP8</name>
                    <description>CT_INP8</description>
                    <value>0x8</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP9</name>
                    <description>CT_INP9</description>
                    <value>0x9</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP10</name>
                    <description>CT_INP10</description>
                    <value>0xA</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP11</name>
                    <description>CT_INP11</description>
                    <value>0xB</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP12</name>
                    <description>CT_INP12</description>
                    <value>0xC</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP13</name>
                    <description>CT_INP13</description>
                    <value>0xD</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP14</name>
                    <description>CT_INP14</description>
                    <value>0xE</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>CT_INP15</name>
                    <description>CT_INP15</description>
                    <value>0xF</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SHARED_I2S0_WS</name>
                    <description>SHARED I2S0_WS</description>
                    <value>0x10</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>SHARED_I2S1_WS</name>
                    <description>SHARED I2S1_WS</description>
                    <value>0x11</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>USB1_FRAME_TOGGLE</name>
                    <description>USB1_FRAME_TOGGLE</description>
                    <value>0x12</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0,1</dimIndex>
          <name>FMEASURE_CH_SEL%s</name>
          <description>Frequency Measurement Input Channel Multiplexers</description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1F</resetValue>
          <resetMask>0x1F</resetMask>
          <fields>
            <field>
              <name>FMEASURE_SEL</name>
              <description>Frequency Measure Channel n Selection 7:1 Mux Select. . .</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTALIN</name>
                  <description>XTALIN</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SFRO</name>
                  <description>SFRO</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FFRO</name>
                  <description>FFRO</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPOSC</name>
                  <description>Low Power Oscillator Clock (LPOSC)</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTC_32KHz_OSC</name>
                  <description>RTC 32KHz OSC</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAIN_SYS_CLOCK</name>
                  <description>MAIN_SYS_CLOCK</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FREQME_GPIO_CLK</name>
                  <description>FREQME_GPIO_CLK</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
