Masmiseim36/nxpSDK/devices/MIMXRT685S/MIMXRT685S_cm33.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>FREQME</name>
      <description>LPC_Next0 Frequency Measurement (FREQME)</description>
      <groupName>FREQME</groupName>
      <baseAddress>0x4002F000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>FREQMECTRL_R</name>
          <description>Frequency Measurement (in Read mode)</description>
          <alternateGroup>READ_MODE</alternateGroup>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RESULT</name>
              <description>Result</description>
              <bitOffset>0</bitOffset>
              <bitWidth>31</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MEASURE_IN_PROGRESS</name>
              <description>Measure in Progress</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CYCLE_DONE</name>
                  <description>Process complete. Measurement cycle is complete. The results are ready in the RESULT field.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN_PROGRESS</name>
                  <description>In Progress. Measurement cycle is in progress.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FREQMECTRL_W</name>
          <description>Freqeuncy Measurement (in Write mode)</description>
          <alternateGroup>WRITE_MODE</alternateGroup>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REF_SCALE</name>
              <description>Reference Clock Scaling Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COUNTCYCLE_1</name>
                  <description>Count cycle = 2^0 = 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTCYCLE_2</name>
                  <description>Count cycle = 2^1 = 2</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTCYCLE_4</name>
                  <description>Count cycle = 2^4 = 4</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTCYCLE_31</name>
                  <description>Count cycle = 2^31 = 2,147,483,648</description>
                  <value>0x1F</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULSE_MODE</name>
              <description>Pulse Width Measurement mode select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FREQ_ME_MODE</name>
                  <description>Frequency Measurement Mode. FREQMECTRL works in a Frequency Measurement mode. Once the measurement starts (real count start is aligned at rising edge arrival on reference clock), the target counter increments by the target clock until the reference counter running by the reference clock reaches the count end point selected by REF_SCALE.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PULSE_ME_MODE</name>
                  <description>Pulse Width Measurement mode. FREQMECTRL works in a Pulse Width Measurement mode, measuring the high or low period of reference clock input selected by PULSE_POL. The target counter starts incrementing by the target clock once a corresponding trigger edge (rising edge for high period measurement and falling edge for low period) occurs.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PULSE_POL</name>
              <description>Pulse Polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH_PERIOD</name>
                  <description>High Period. High period of reference clock is measured in Pulse Width Measurement mode triggered by the rising edge on the reference clock input.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW_PERIOD</name>
                  <description>Low Period. Low period of reference clock is measured in Pulse Width Measurement mode triggered by the falling edge on the reference clock input.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MEASURE_IN_PROGRESS</name>
              <description>Measure in Progress</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FORCE_TERMINATE</name>
                  <description>Force Terminate. Forces the termination of any measurement cycle currently in progress and resets RESULT or just resets RESULT if in idle.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INITIATE_A_FREQME_CYCLE</name>
                  <description>Initiates Measurement Cycle. Initiates frequency or pulse width measurement process. Hardware clears the MEASURE_IN_PROGRESS bit when the measurement cycle completes. A new measurement starts if there is an active measurement in progress.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
