Masmiseim36/nxpSDK/devices/MIMXRT685S/MIMXRT685S_cm33.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>CACHE64</name>
      <description>CACHE64</description>
      <groupName>CACHE64</groupName>
      <baseAddress>0x40033000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x810</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CCR</name>
          <description>Cache control register</description>
          <addressOffset>0x800</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENCACHE</name>
              <description>Cache enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Cache disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Cache enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENWRBUF</name>
              <description>Enable Write Buffer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>disabled</name>
                  <description>Write buffer disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>enabled</name>
                  <description>Write buffer enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVW0</name>
              <description>Invalidate Way 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_operation</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>invw0</name>
                  <description>When setting the GO bit, invalidate all lines in way 0.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUSHW0</name>
              <description>Push Way 0</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_operation</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pushw0</name>
                  <description>When setting the GO bit, push all modified lines in way 0</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INVW1</name>
              <description>Invalidate Way 1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_operation</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>invw1</name>
                  <description>When setting the GO bit, invalidate all lines in way 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PUSHW1</name>
              <description>Push Way 1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_operation</name>
                  <description>No operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>pushw1</name>
                  <description>When setting the GO bit, push all modified lines in way 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GO</name>
              <description>Initiate Cache Command</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_effect</name>
                  <description>Write: no effect. Read: no cache command active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>init_cmd</name>
                  <description>Write: initiate command indicated by bits 27-24. Read: cache command active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CLCR</name>
          <description>Cache line control register</description>
          <addressOffset>0x804</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LGO</name>
              <description>Initiate Cache Line Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_effect</name>
                  <description>Write: no effect. Read: no line command active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>init_cmd</name>
                  <description>Write: initiate line command indicated by bits 27-24. Read: line command active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CACHEADDR</name>
              <description>Cache address</description>
              <bitOffset>2</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WSEL</name>
              <description>Way select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>way0</name>
                  <description>Way 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>way1</name>
                  <description>Way 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TDSEL</name>
              <description>Tag/Data Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>data</name>
                  <description>Data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>tag</name>
                  <description>Tag</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCIVB</name>
              <description>Line Command Initial Valid Bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCIMB</name>
              <description>Line Command Initial Modified Bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCWAY</name>
              <description>Line Command Way</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCMD</name>
              <description>Line Command</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>search_rw</name>
                  <description>Search and read or write</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>invalidate</name>
                  <description>Invalidate</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>push</name>
                  <description>Push</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>clear</name>
                  <description>Clear</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LADSEL</name>
              <description>Line Address Select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>cache_addr</name>
                  <description>Cache address</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>phys_addr</name>
                  <description>Physical address</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LACC</name>
              <description>Line access type</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>read</name>
                  <description>Read</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>write</name>
                  <description>Write</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSAR</name>
          <description>Cache search address register</description>
          <addressOffset>0x808</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LGO</name>
              <description>Initiate Cache Line Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>no_effect</name>
                  <description>Write: no effect. Read: no line command active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>init_cmd</name>
                  <description>Write: initiate line command indicated by bits CLCR[27:24]. Read: line command active.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PHYADDR27_1</name>
              <description>Physical Address</description>
              <bitOffset>1</bitOffset>
              <bitWidth>27</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYADDR31_29</name>
              <description>Physical Address</description>
              <bitOffset>29</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCVR</name>
          <description>Cache read/write value register</description>
          <addressOffset>0x80C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Cache read/write Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
