Masmiseim36/nxpSDK/devices/MIMXRT685S/MIMXRT685S_cm33.xml
        <register>
          <name>TRIM_OVERRIDE_EN_SET</name>
          <description>USB PHY Trim Override Enable Register</description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM_DIV_SEL_OVERRIDE</name>
              <description>Override enable for PLL_DIV_SEL, when set, the register value in PLL_SIC[1:0] will be used.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_ENV_TAIL_ADJ_VD_OVERRIDE</name>
              <description>Override enable for ENV_TAIL_ADJ, when set, the register value in DEBUG1[14:13] will be used.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_TX_D_CAL_OVERRIDE</name>
              <description>Override enable for TX_D_CAL, when set, the register value in TX[3:0] will be used.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_TX_CAL45DP_OVERRIDE</name>
              <description>Override enable for TX_CAL45DP, when set, the register value in TX[19:16] will be used.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_TX_CAL45DM_OVERRIDE</name>
              <description>Override enable for TX_CAL45DM, when set, the register value in TX[11:8] will be used.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_REFBIAS_VBGADJ_OVERRIDE</name>
              <description>Override enable for bandgap adjustment</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_REFBIAS_TST_OVERRIDE</name>
              <description>Override enable for bias current control When this field is set, the register value in DEBUG1[22:21] will be used</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USB2_REFBIAS_VBGADJ</name>
              <description>Adjustment bits for bandgap</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USB2_REFBIAS_TST</name>
              <description>Bias current control for usb2_phy</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_PLL_CTRL0_DIV_SEL</name>
              <description>IFR value of PLL_DIV_SEL.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USB_REG_ENV_TAIL_ADJ_VD</name>
              <description>IFR value of ENV_TAIL_ADJ.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_D_CAL</name>
              <description>IFR value of TX_D_CAL.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_CAL45DP</name>
              <description>IFR value of TX_CAL45DP.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_CAL45DM</name>
              <description>IFR value of TX_CAL45DM.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_OVERRIDE_EN_CLR</name>
          <description>USB PHY Trim Override Enable Register</description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM_DIV_SEL_OVERRIDE</name>
              <description>Override enable for PLL_DIV_SEL, when set, the register value in PLL_SIC[1:0] will be used.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_ENV_TAIL_ADJ_VD_OVERRIDE</name>
              <description>Override enable for ENV_TAIL_ADJ, when set, the register value in DEBUG1[14:13] will be used.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_TX_D_CAL_OVERRIDE</name>
              <description>Override enable for TX_D_CAL, when set, the register value in TX[3:0] will be used.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_TX_CAL45DP_OVERRIDE</name>
              <description>Override enable for TX_CAL45DP, when set, the register value in TX[19:16] will be used.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_TX_CAL45DM_OVERRIDE</name>
              <description>Override enable for TX_CAL45DM, when set, the register value in TX[11:8] will be used.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_REFBIAS_VBGADJ_OVERRIDE</name>
              <description>Override enable for bandgap adjustment</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_REFBIAS_TST_OVERRIDE</name>
              <description>Override enable for bias current control When this field is set, the register value in DEBUG1[22:21] will be used</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USB2_REFBIAS_VBGADJ</name>
              <description>Adjustment bits for bandgap</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USB2_REFBIAS_TST</name>
              <description>Bias current control for usb2_phy</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_PLL_CTRL0_DIV_SEL</name>
              <description>IFR value of PLL_DIV_SEL.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USB_REG_ENV_TAIL_ADJ_VD</name>
              <description>IFR value of ENV_TAIL_ADJ.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_D_CAL</name>
              <description>IFR value of TX_D_CAL.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_CAL45DP</name>
              <description>IFR value of TX_CAL45DP.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_CAL45DM</name>
              <description>IFR value of TX_CAL45DM.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_OVERRIDE_EN_TOG</name>
          <description>USB PHY Trim Override Enable Register</description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIM_DIV_SEL_OVERRIDE</name>
              <description>Override enable for PLL_DIV_SEL, when set, the register value in PLL_SIC[1:0] will be used.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_ENV_TAIL_ADJ_VD_OVERRIDE</name>
              <description>Override enable for ENV_TAIL_ADJ, when set, the register value in DEBUG1[14:13] will be used.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_TX_D_CAL_OVERRIDE</name>
              <description>Override enable for TX_D_CAL, when set, the register value in TX[3:0] will be used.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_TX_CAL45DP_OVERRIDE</name>
              <description>Override enable for TX_CAL45DP, when set, the register value in TX[19:16] will be used.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_TX_CAL45DM_OVERRIDE</name>
              <description>Override enable for TX_CAL45DM, when set, the register value in TX[11:8] will be used.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_REFBIAS_VBGADJ_OVERRIDE</name>
              <description>Override enable for bandgap adjustment</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_REFBIAS_TST_OVERRIDE</name>
              <description>Override enable for bias current control When this field is set, the register value in DEBUG1[22:21] will be used</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USB2_REFBIAS_VBGADJ</name>
              <description>Adjustment bits for bandgap</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USB2_REFBIAS_TST</name>
              <description>Bias current control for usb2_phy</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_PLL_CTRL0_DIV_SEL</name>
              <description>IFR value of PLL_DIV_SEL.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USB_REG_ENV_TAIL_ADJ_VD</name>
              <description>IFR value of ENV_TAIL_ADJ.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_D_CAL</name>
              <description>IFR value of TX_D_CAL.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_CAL45DP</name>
              <description>IFR value of TX_CAL45DP.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRIM_USBPHY_TX_CAL45DM</name>
              <description>IFR value of TX_CAL45DM.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
