Masmiseim36/nxpSDK/devices/MIMXRT685S/MIMXRT685S_cm33.xml
        <register>
          <name>APB_GRP0_MEM_RULE0</name>
          <description>Security access rules for APB Bridge 0 peripherals. Each APB bridge sector is 4 Kbytes, there're 16 sectors in total.</description>
          <addressOffset>0x340</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSTCTL0_RULE</name>
              <description>0x4000 0000--0x4000 0FFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKCTL0_RULE</name>
              <description>0x4000 1000--0x4000 1FFF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL0_RULE</name>
              <description>0x4000 2000--0x4000 2FFF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IOPCTL_RULE</name>
              <description>0x4000 4000--0x4000 4FFF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUFCTRL_RULE</name>
              <description>0x4000 6000--0x4000 6FFF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_GRP0_MEM_RULE1</name>
          <description>Security access rules for APB Bridge 0 peripherals. Each APB bridge sector is 4 Kbytes, there're 16 sectors in total.</description>
          <addressOffset>0x344</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WWDT0_RULE</name>
              <description>0x4000 E000--0x4000 EFFF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UTICK_RULE</name>
              <description>0x4000 F000--0x4000 FFFF</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_GRP1_MEM_RULE0</name>
          <description>Security access rules for APB Bridge 1 peripherals. Each APB bridge sector is 4 Kbytes, there're 16 sectors in total.</description>
          <addressOffset>0x350</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSTCTL1_RULE</name>
              <description>0x4002 0000--0x4002 0FFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKCTL1_RULE</name>
              <description>0x4002 1000--0x4002 1FFF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSCTL1_RULE</name>
              <description>0x4002 2000--0x4002 2FFF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GPIO_INTR_CTRL_RULE</name>
              <description>0x4002 5000--0x4002 5FFF</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIPH_INPUT_MUX_RULE</name>
              <description>0x4002 6000--0x4002 6FFF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_GRP1_MEM_RULE1</name>
          <description>Security access rules for APB Bridge 1 peripherals. Each APB bridge sector is 4 Kbytes, there're 16 sectors in total.</description>
          <addressOffset>0x354</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CT32BIT0_RULE</name>
              <description>0x4002 8000--0x4002 8FFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CT32BIT1_RULE</name>
              <description>0x4002 9000--0x4002 9FFF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CT32BIT2_RULE</name>
              <description>0x4002 A000--0x4002 AFFF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CT32BIT3_RULE</name>
              <description>0x4002 B000--0x4002 BFFF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CT32BIT4_RULE</name>
              <description>0x4002 C000--0x4002 CFFF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MRT_RULE</name>
              <description>0x4002 D000--0x4002 DFFF</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WWDT1_RULE</name>
              <description>0x4002 E000--0x4002 EFFF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FREQME_RULE</name>
              <description>0x4002 F000--0x4002 FFFF</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APB_GRP1_MEM_RULE2</name>
          <description>Security access rules for APB Bridge 1 peripherals. Each APB bridge sector is 4 Kbytes, there're 16 sectors in total.</description>
          <addressOffset>0x358</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RTC_RULE</name>
              <description>0x4003 0000--0x4003 0FFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I3C0_RULE</name>
              <description>0x4003 6000--0x4003 6FFF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_PERIPH0_SLAVE_RULE0</name>
          <description>Security access rules for AHB peripheral slaves area 0x40100000--0x4010FFFF</description>
          <addressOffset>0x360</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSGPIO_RULE</name>
              <description>0x40100000--0x40103FFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA0_RULE</name>
              <description>0x40104000--0x40104FFF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMA1_RULE</name>
              <description>0x40105000--0x40105FFF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM0_RULE</name>
              <description>0x40106000--0x40106FFF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM1_RULE</name>
              <description>0x40107000--0x40107FFF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM2_RULE</name>
              <description>0x40108000--0x40108FFF</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM3_RULE</name>
              <description>0x40109000--0x40109FFF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBUG_MAILBOX_RULE</name>
              <description>0x4010F000--0x4010FFFF</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AIPS_BRIDGE0_MEM_RULE0</name>
          <description>0x40110000--0x4011FFFF</description>
          <addressOffset>0x370</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MU0_M33_RULE</name>
              <description>0x4011 0000--0x4011 0FFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MU0_DSP_RULE</name>
              <description>0x4011 1000--0x4011 1FFF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SEMAPHORE_RULE</name>
              <description>0x4011 2000--0x4011 2FFF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OS_EVENT_TIMER_M33_RULE</name>
              <description>0x4011 3000--0x4011 3FFF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OS_EVENT_TIMER_DSP_RULE</name>
              <description>0x4011 4000--0x4011 4FFF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_PERIPH1_SLAVE_RULE0</name>
          <description>the memory map is 0x40120000--0x40127FFF</description>
          <addressOffset>0x380</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRC_RULE</name>
              <description>Security access rules for AHB peripheral slaves area 0x40120000--0x40120FFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMIC_RULE</name>
              <description>0x40121000--0x40121FFF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM4_RULE</name>
              <description>0x40122000--0x40122FFF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM5_RULE</name>
              <description>0x40123000--0x40123FFF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM6_RULE</name>
              <description>0x40124000--0x40124FFF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM7_RULE</name>
              <description>0x40125000--0x40125FFF</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM14_RULE</name>
              <description>0x40126000--0x40126FFF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXCOMM15_RULE</name>
              <description>0x40127000--0x40127FFF</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AIPS_BRIDGE1_MEM_RULE0</name>
          <description>Security access rules for AIPS Bridge peripherals. Each AIPS bridge sector is 4 Kbytes, there're 16 sectors in total.</description>
          <addressOffset>0x3A0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OTP_RULE0</name>
              <description>0x4013 0000--0x4013 0FFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTP_RULE1</name>
              <description>0x4013 1000--0x4013 1FFF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTP_RULE2</name>
              <description>0x4013 2000--0x4013 2FFF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OTP_RULE3</name>
              <description>0x4013 3000--0x4013 3FFF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLEXSPI_AND_OTFAD_RULE</name>
              <description>0x4013 4000--0x4013 4FFF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO0_RULE</name>
              <description>0x4013 6000--0x4013 6FFF</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDIO1_RULE</name>
              <description>0x4013 7000--0x4013 7FFF</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AIPS_BRIDGE1_MEM_RULE1</name>
          <description>Security access rules for AIPS Bridge peripherals. Each AIPS bridge sector is 4 Kbytes, there're 16 sectors in total.</description>
          <addressOffset>0x3A4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RNG_RULE</name>
              <description>0x4013 8000--0x4013 8FFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACMP0_RULE</name>
              <description>0x4013 9000--0x4013 9FFF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC0_RULE</name>
              <description>0x4013 A000--0x4013 AFFF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_HS_PHY_RULE</name>
              <description>0x4013 B000--0x4013 BFFF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_PERIPH2_SLAVE_RULE0</name>
          <description>Security access rules for AHB peripheral slaves area 0x40140000--0x4014BFFF</description>
          <addressOffset>0x3B0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>USB_HS_RAM_RULE</name>
              <description>0x40140000--0x40143FFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_HS_DEV_RULE</name>
              <description>0x40144000--0x40144FFF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB_HS_HOST_RULE</name>
              <description>0x40145000--0x40145FFF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SCT_RULE</name>
              <description>0x40146000--0x40146FFF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SECURITY_CTRL_MEM_RULE0</name>
          <description>0x40148000--0x4014BFFF</description>
          <addressOffset>0x3C0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RULE0</name>
              <description>secure control rule0. it can be set when check_reg's write_lock is '0'</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RULE1</name>
              <description>secure control rule0. it can be set when check_reg's write_lock is '0'</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RULE2</name>
              <description>secure control rule0. it can be set when check_reg's write_lock is '0'</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RULE3</name>
              <description>secure control rule0. it can be set when check_reg's write_lock is '0'</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB_PERIPH3_SLAVE_RULE0</name>
          <description>Security access rules for AHB peripheral slaves area 0x40150000--0x40158FFF</description>
          <addressOffset>0x3D0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PQ_COPRO_RULE</name>
              <description>0x40150000--0x40150FFF</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CASPER_COPRO_RULE</name>
              <description>0x40151000--0x40151FFF</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CASPER_RAM_RULE</name>
              <description>0x40152000--0x40152FFF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECURE_GPIO_RULE</name>
              <description>0x40154000--0x40157FFF</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HASH_RULE</name>
              <description>0x40158000--0x40158FFF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
