Masmiseim36/nxpSDK/devices/MIMXRT685S/MIMXRT685S_cm33.xml
        <register>
          <name>SEC_GPIO_MASK5</name>
          <description>Secure GPIO mask for port 5 pins.</description>
          <addressOffset>0xF94</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIO5_PIN0_SEC_MASK</name>
              <description>0 : Pin PIO5_0 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN1_SEC_MASK</name>
              <description>0 : Pin PIO5_1 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN2_SEC_MASK</name>
              <description>0 : Pin PIO5_2 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN3_SEC_MASK</name>
              <description>0 : Pin PIO5_3 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN4_SEC_MASK</name>
              <description>0 : Pin PIO5_4 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN5_SEC_MASK</name>
              <description>0 : Pin PIO5_5 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN6_SEC_MASK</name>
              <description>0 : Pin PIO5_6 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN7_SEC_MASK</name>
              <description>0 : Pin PIO5_7 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN8_SEC_MASK</name>
              <description>0 : Pin PIO5_8 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN9_SEC_MASK</name>
              <description>0 : Pin PIO5_9 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN10_SEC_MASK</name>
              <description>0 : Pin PIO5_10 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN11_SEC_MASK</name>
              <description>0 : Pin PIO5_11 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN12_SEC_MASK</name>
              <description>0 : Pin PIO5_12 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN13_SEC_MASK</name>
              <description>0 : Pin PIO5_13 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN14_SEC_MASK</name>
              <description>0 : Pin PIO5_14 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN15_SEC_MASK</name>
              <description>0 : Pin PIO5_15 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN16_SEC_MASK</name>
              <description>0 : Pin PIO5_16 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN17_SEC_MASK</name>
              <description>0 : Pin PIO5_17 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN18_SEC_MASK</name>
              <description>0 : Pin PIO5_18 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN19_SEC_MASK</name>
              <description>0 : Pin PIO5_19 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN20_SEC_MASK</name>
              <description>0 : Pin PIO5_20 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN21_SEC_MASK</name>
              <description>0 : Pin PIO5_21 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN22_SEC_MASK</name>
              <description>0 : Pin PIO5_22 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN23_SEC_MASK</name>
              <description>0 : Pin PIO5_23 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN24_SEC_MASK</name>
              <description>0 : Pin PIO5_24 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN25_SEC_MASK</name>
              <description>0 : Pin PIO5_25 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN26_SEC_MASK</name>
              <description>0 : Pin PIO5_26 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN27_SEC_MASK</name>
              <description>0 : Pin PIO5_27 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN28_SEC_MASK</name>
              <description>0 : Pin PIO5_28 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN29_SEC_MASK</name>
              <description>0 : Pin PIO5_29 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN30_SEC_MASK</name>
              <description>0 : Pin PIO5_30 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO5_PIN31_SEC_MASK</name>
              <description>0 : Pin PIO5_31 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SEC_GPIO_MASK6</name>
          <description>Secure GPIO mask for port 6 pins.</description>
          <addressOffset>0xF98</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PIO6_PIN0_SEC_MASK</name>
              <description>0 : Pin PIO6_0 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN1_SEC_MASK</name>
              <description>0 : Pin PIO6_1 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN2_SEC_MASK</name>
              <description>0 : Pin PIO6_2 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN3_SEC_MASK</name>
              <description>0 : Pin PIO6_3 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN4_SEC_MASK</name>
              <description>0 : Pin PIO6_4 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN5_SEC_MASK</name>
              <description>0 : Pin PIO6_5 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN6_SEC_MASK</name>
              <description>0 : Pin PIO6_6 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN7_SEC_MASK</name>
              <description>0 : Pin PIO6_7 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN8_SEC_MASK</name>
              <description>0 : Pin PIO6_8 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN9_SEC_MASK</name>
              <description>0 : Pin PIO6_9 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN10_SEC_MASK</name>
              <description>0 : Pin PIO6_10 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN11_SEC_MASK</name>
              <description>0 : Pin PIO6_11 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN12_SEC_MASK</name>
              <description>0 : Pin PIO6_12 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN13_SEC_MASK</name>
              <description>0 : Pin PIO6_13 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN14_SEC_MASK</name>
              <description>0 : Pin PIO6_14 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN15_SEC_MASK</name>
              <description>0 : Pin PIO6_15 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN16_SEC_MASK</name>
              <description>0 : Pin PIO6_16 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN17_SEC_MASK</name>
              <description>0 : Pin PIO6_17 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN18_SEC_MASK</name>
              <description>0 : Pin PIO6_18 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN19_SEC_MASK</name>
              <description>0 : Pin PIO6_19 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN20_SEC_MASK</name>
              <description>0 : Pin PIO6_20 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN21_SEC_MASK</name>
              <description>0 : Pin PIO6_21 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN22_SEC_MASK</name>
              <description>0 : Pin PIO6_22 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN23_SEC_MASK</name>
              <description>0 : Pin PIO6_23 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN24_SEC_MASK</name>
              <description>0 : Pin PIO6_24 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN25_SEC_MASK</name>
              <description>0 : Pin PIO6_25 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN26_SEC_MASK</name>
              <description>0 : Pin PIO6_26 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN27_SEC_MASK</name>
              <description>0 : Pin PIO6_27 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN28_SEC_MASK</name>
              <description>0 : Pin PIO6_28 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN29_SEC_MASK</name>
              <description>0 : Pin PIO6_29 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN30_SEC_MASK</name>
              <description>0 : Pin PIO6_30 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PIO6_PIN31_SEC_MASK</name>
              <description>0 : Pin PIO6_31 state is readable by non-secure world through non-secure GPIO port control registers</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
